app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `remember_token`, `login`, `email`, `created_at`) VALUES('', 'ce41d1d3ea87f0e87b82fba5a7d851a3e2edf503', '2009-03-23 09:54:00', 'e7049494a77bb2b5f8be29d9ef90178f8992d871', NULL, NULL, 'superadmin', 'shree@elynxsol.com', '2009-03-23 09:54:00')